//=========================================
// 
// オブジェクトクラス
// Author YudaKaito
// 
//=========================================
//-----------------------------------------
// include
//-----------------------------------------
#include "bullet.h"

//-----------------------------------------
// コンストラクタ
//-----------------------------------------
CBullet::CBullet() :
	m_move(D3DXVECTOR3(0.0f, 0.0f, 0.0f)),
	m_life(0)
{

}

//-----------------------------------------
// デストラクタ
//-----------------------------------------
CBullet::~CBullet()
{

}

//-----------------------------------------
// 初期化
//-----------------------------------------
HRESULT CBullet::Init()
{
	CObject2D::Init();
	m_life = 50;
	return S_OK;
}

//-----------------------------------------
// 終了
//-----------------------------------------
void CBullet::Uninit()
{
	CObject2D::Uninit();
}

//-----------------------------------------
// 更新
//-----------------------------------------
void CBullet::Update()
{
	// 体力の減少
	m_life--;

	// 位置の設定
	SetPos(GetPos() + m_move);

	// 死亡処理
	if (m_life <= 0)
	{
		Release();
	}
}

//-----------------------------------------
// 描画
//-----------------------------------------
void CBullet::Draw()
{
	CObject2D::Draw();
}

//-----------------------------------------
// 生成
//-----------------------------------------
CBullet* CBullet::Create(const D3DXVECTOR3& inPos, const D3DXVECTOR3& inMove)
{
	CBullet* bullet = new CBullet;

	if (bullet == nullptr)
	{
		return nullptr;
	}

	bullet->Init();
	bullet->SetPos(inPos);
	bullet->m_move = inMove;
	bullet->SetSize(D3DXVECTOR2(10.0f, 10.0f));

	return bullet;
}
