//=============================================================================
// 
// アプリケーションクラス
// Author YudaKaito
// 
//=============================================================================
//-----------------------------------------------------------------------------
// include
//-----------------------------------------------------------------------------
#include "game.h"
#include "character.h"
#include "block.h"
#include "map.h"
#include "player_controller.h"
#include "AI_controller.h"
#include <assert.h>

//-----------------------------------------------------------------------------
// コンストラクタ
//-----------------------------------------------------------------------------
CGame::CGame() :
	//character(nullptr),
	map(nullptr)
{
}

//-----------------------------------------------------------------------------
// デストラクタ
//-----------------------------------------------------------------------------
CGame::~CGame()
{
	assert(character.empty());
	assert(map == nullptr);
}

//-----------------------------------------------------------------------------
// 初期化
//-----------------------------------------------------------------------------
HRESULT CGame::Init()
{
	// マップクラス
	map = new CMap;
	if (FAILED(map->Init()))
	{
		return E_FAIL;
	}
	map->Set();

	// プレイヤークラス
	character.push_back(CCharacter::Create(CCharacter::TEAM_00));	// 生成
	character[0]->SetPos(D3DXVECTOR3(800.0f, 300.0f, 0.0f));		// 位置の設定
	character[0]->SetSize(D3DXVECTOR2(20.0f, 20.0f));				// 大きさの設定
	character[0]->SetController(new CPlayerController);				// 命令者の設定

	character.push_back(CCharacter::Create(CCharacter::TEAM_01));	// 生成
	character[1]->SetPos(D3DXVECTOR3(200.0f, 300.0f, 0.0f));		// 位置の設定
	character[1]->SetSize(D3DXVECTOR2(20.0f, 20.0f));				// 大きさの設定
	character[1]->SetController(new CPlayerController);				// 命令者の設定

	return S_OK;
}

//-----------------------------------------------------------------------------
// 終了
//-----------------------------------------------------------------------------
void CGame::Uninit()
{
	for (auto it = character.begin(); it != character.end();)
	{
		(*it)->Uninit();
	}
}

//-----------------------------------------------------------------------------
// 更新
//-----------------------------------------------------------------------------
void CGame::Update()
{
}

//-----------------------------------------------------------------------------
// 描画
//-----------------------------------------------------------------------------
void CGame::Draw()
{
}
