//=========================================
// 
// チーム選択メニュークラス
// Author YudaKaito
// 
//=========================================
//-----------------------------------------
// include
//-----------------------------------------
#include "menu_team_select.h"

//-----------------------------------------
// コンストラクタ
//-----------------------------------------
CTeamSelectMenu::CTeamSelectMenu()
{
}

//-----------------------------------------
// デストラクタ
//-----------------------------------------
CTeamSelectMenu::~CTeamSelectMenu()
{
}

//-----------------------------------------
// 決定前の更新
//-----------------------------------------
void CTeamSelectMenu::UpdateBeforeDecision()
{
}

//-----------------------------------------
// 決定後の更新
//-----------------------------------------
void CTeamSelectMenu::UpdateAfterDecision()
{
}

//=========================================
// 
// チーム選択メニューフレームクラス
// Author YudaKaito
// 
//=========================================
//-----------------------------------------
// コンストラクタ
//-----------------------------------------
CTeamSelectMenuFream::CTeamSelectMenuFream(CObject::TYPE type):
	CMenuFream(type)
{
}

//-----------------------------------------
// デストラクタ
//-----------------------------------------
CTeamSelectMenuFream::~CTeamSelectMenuFream()
{
}

//-----------------------------------------
// 初期化
//-----------------------------------------
HRESULT CTeamSelectMenuFream::Init()
{
	return E_NOTIMPL;
}

//-----------------------------------------
// 終了
//-----------------------------------------
void CTeamSelectMenuFream::Uninit()
{
}

//-----------------------------------------
// 更新
//-----------------------------------------
void CTeamSelectMenuFream::Update()
{
}

//=========================================
// 
// チーム選択メニューアイテムクラス
// Author YudaKaito
// 
//=========================================
//-----------------------------------------
// コンストラクタ
//-----------------------------------------
CTeamSelectMenuItem::CTeamSelectMenuItem(CObject::TYPE type) :
	CMenuItem(type)
{
}

//-----------------------------------------
// デストラクタ
//-----------------------------------------
CTeamSelectMenuItem::~CTeamSelectMenuItem()
{
}

//-----------------------------------------
// 初期化
//-----------------------------------------
HRESULT CTeamSelectMenuItem::Init()
{
	return E_NOTIMPL;
}

//-----------------------------------------
// 終了
//-----------------------------------------
void CTeamSelectMenuItem::Uninit()
{
}

//-----------------------------------------
// 出現状態の更新
//-----------------------------------------
void CTeamSelectMenuItem::PopUpdate()
{
}

//-----------------------------------------
// 選択状態の更新
//-----------------------------------------
void CTeamSelectMenuItem::SelectUpdate()
{
}

//-----------------------------------------
// 通常状態の更新
//-----------------------------------------
void CTeamSelectMenuItem::NomalUpdate()
{
}

//-----------------------------------------
// 終了状態の更新
//-----------------------------------------
void CTeamSelectMenuItem::EndUpdate()
{
}
