//=========================================
// 
// 項目クラス
// Author YudaKaito
// 
//=========================================
#include "menu_item.h"
#include "application.h"

//=========================================
// 
// ポーズ中項目クラス
// Author YudaKaito
// 
//=========================================
//-----------------------------------------
// コンストラクタ
//-----------------------------------------
CPauseMenuItem::CPauseMenuItem(CObject::TYPE type) :
	CMenuItem(type),
	m_text(nullptr)
{
}

//-----------------------------------------
// デストラクタ
//-----------------------------------------
CPauseMenuItem::~CPauseMenuItem()
{
}

//-----------------------------------------
// 出現状態の更新
//-----------------------------------------
void CPauseMenuItem::PopUpdate()
{
}

//-----------------------------------------
// 選択状態の更新
//-----------------------------------------
void CPauseMenuItem::SelectUpdate()
{
	SetColor(CApplication::GetInstance()->GetColor(3));
}

//-----------------------------------------
// 通常状態の更新
//-----------------------------------------
void CPauseMenuItem::NomalUpdate()
{
	SetColor(CApplication::GetInstance()->GetColor(2));
}

//-----------------------------------------
// 終了状態の更新
//-----------------------------------------
void CPauseMenuItem::EndUpdate()
{
}
